-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1
-- Время создания: Июл 09 2016 г., 14:24
-- Версия сервера: 10.1.13-MariaDB
-- Версия PHP: 7.0.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `edoc`
--

-- --------------------------------------------------------

--
-- Структура таблицы `passwords`
--

CREATE TABLE `passwords` (
  `id` int(10) UNSIGNED NOT NULL,
  `pass` varchar(255) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп данных таблицы `passwords`
--

INSERT INTO `passwords` (`id`, `pass`) VALUES
(1, 'y$2`-n/t5e');

-- --------------------------------------------------------

--
-- Структура таблицы `rdas`
--

CREATE TABLE `rdas` (
  `id` int(10) UNSIGNED NOT NULL,
  `name_rda` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `name_admin_services` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп данных таблицы `rdas`
--

INSERT INTO `rdas` (`id`, `name_rda`, `name_admin_services`, `email`) VALUES
(1, 'Миколаїв місто', 'Центр надання адміністративних послуг Миколаївської міської ради', 'nikolaev.dc@gmail.com'),
(2, 'Вознесенськ місто', 'Центр надання адміністративних послуг у м. Вознесенську', 'cnapvoznesensk@gmail.com '),
(3, 'Очаків місто', 'Центр надання адміністративних послуг Очаківської міської ради', 'adm.center.оchakov@i.ua'),
(4, 'Первомайськ місто', 'Центр надання адміністративних послуг апарату виконавчого комітету Первомайської міської ради', 'vykonkom@pervomaysk.info'),
(5, 'Южноукраїнськ місто', 'Центр надання адміністративних послуг міста Южноукраїнська', 'oksanamary@yandex.ua '),
(6, 'Арбузинська РДА ', 'Центр надання адміністративних послуг при Арбузинській районній державній адміністрації', 'arbcnap@ukr.net '),
(7, 'Баштанська РДА', 'Центр надання адміністративних послуг при Баштанській райдержадміністрації', 'cnap.bashtanka@yandex.ru'),
(8, 'Березанська РДА', 'Центр надання адміністративних послуг при Березанській райдержадміністрації', 'berezandozvil@ukr.net'),
(9, 'Березнегуватська РДА', 'Центр надання адміністративних послуг Березнегуватської райдержадміністрації', 'lady.grigorashchenko@mail.ru'),
(10, 'Братська РДА', 'Центр надання адміністративних послуг при Братській райдержадміністрації', 'brt.cnap@gmail.com'),
(11, 'Веселинівська РДА', 'Центр надання адміністративних послуг Веселинівської райдержадміністрації', 'ves.cnap@ukr.net'),
(12, 'Вознесенська РДА', 'Центр надання адміністративних послуг у Вознесенському районі', ''),
(13, 'Врадіївська РДА', 'Центр надання адміністративних послуг Врадіївського району', ''),
(14, 'Доманівська РДА', 'Центр надання адміністративних послуг Доманівської районної державної адміністрації', 'doman_cnap@ukr.net'),
(15, 'Єланецька РДА', 'Центр надання адміністративних послуг при Єланецькій райдержадміністрації', 'admin.Chuguta@ukr.net'),
(16, 'Жовтнева РДА', 'Центр надання адміністративних послуг Жовтневої районної державної адміністрації', 'gosadmin_govtnevoe@ukr.net'),
(17, 'Казанківська РДА', 'Центр надання адміністративних послуг Казанківської райдержадміністрації', 'kazanka_cnap@ukr.net'),
(18, 'Кривоозерська РДА', 'Центр надання адміністративних послуг Кривоозерської районної держадміністрації', 'krozero_cnap@i.ua'),
(19, 'Миколаївська РДА', 'Центр надання адміністративних послуг Миколаївської районної державної адміністрації', 'admin_mykolayiv-rda@ukr.net'),
(20, 'Новобузька РДА', 'Центр надання адміністративних послуг при Новобузькій райдержадміністрації', 'cnap-2015@ukr.net'),
(21, 'Новоодеська РДА', 'Центр надання адміністративних послуг Новоодеської райдержадміністрації', 'protsyk8@ukr.net'),
(22, 'Очаківська РДА', 'Центр надання адміністративних послуг при Очаківській районній державній адміністрації', 'nonnakolesnik@ukr.net'),
(23, 'Первомайська РДА', 'Центр надання адміністративних послуг Первомайської райдержадміністрації', 'dozv.perv.rayon@ukr.net '),
(24, 'Снігурівська РДА', 'Центр надання адміністративних послуг Снігурівської районної державної адміністрації', 'cnap.snigurivka@ukr.net ');

-- --------------------------------------------------------

--
-- Структура таблицы `register_admin_services`
--

CREATE TABLE `register_admin_services` (
  `id` int(10) UNSIGNED NOT NULL,
  `date_package_doc_RDA` date NOT NULL,
  `reg_num_doc` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `rda_id` int(11) NOT NULL,
  `correspondent` varchar(240) COLLATE utf8_unicode_ci NOT NULL,
  `snap_id` int(11) NOT NULL,
  `date_transmission_doc_snap` date NOT NULL,
  `snap_name_receiv_doc` varchar(240) COLLATE utf8_unicode_ci NOT NULL,
  `deadline` date NOT NULL,
  `returning_res_admin_services_snap` date DEFAULT NULL,
  `date_representatives_rda_doc` date DEFAULT NULL,
  `recipient_name_doc` varchar(240) COLLATE utf8_unicode_ci DEFAULT NULL,
  `note` text COLLATE utf8_unicode_ci,
  `status` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `snaps`
--

CREATE TABLE `snaps` (
  `id` int(10) UNSIGNED NOT NULL,
  `name_entity_providing_admin_services` text COLLATE utf8_unicode_ci NOT NULL,
  `name_admin_services` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп данных таблицы `snaps`
--

INSERT INTO `snaps` (`id`, `name_entity_providing_admin_services`, `name_admin_services`) VALUES
(1, 'Відділ превентивної діяльності Головного управління Національної поліції в Миколаївській області', 'Дозвіл на участь у дорожньому русі транспортних засобів, вагові або габаритні параметри яких перевищують нормативні'),
(2, 'Відділ превентивної діяльності Головного управління Національної поліції в Миколаївській області', 'Погодження маршруту руху транспортного засобу під час дорожнього перевезення небезпечного вантажу'),
(3, 'Відділ превентивної діяльності Головного управління Національної поліції в Миколаївській області', 'Висновок щодо можливості розташування кіосків, павільйонів, пересувних торгівельних пунктів та інших споруд торгівельно-побутового сервісу з виїздом на місце (в разі потреби) для проведення обстеження території або окремих ділянок вулично-шляхової мережі'),
(4, 'Головне управління ДСНС України у Миколаївській області', 'Декларація відповідності матеріально-технічної бази вимогам законодавства з питань пожежної безпеки'),
(5, 'Управління державної архітектурно-будівельної інспекції у Миколаївській області', 'Декларація про початок виконання підготовчих робіт'),
(6, 'Управління державної архітектурно-будівельної інспекції у Миколаївській області', 'Внесення змін до декларації про початок виконання підготовчих робіт'),
(7, 'Управління державної архітектурно-будівельної інспекції у Миколаївській області', 'Декларація про початок виконання будівельних робіт'),
(8, 'Управління державної архітектурно-будівельної інспекції у Миколаївській області', 'Внесення змін до декларації про початок виконання будівельних робіт'),
(9, 'Управління державної архітектурно-будівельної інспекції у Миколаївській області', 'Декларація про готовність об''єкта до експлуатації'),
(10, 'Управління державної архітектурно-будівельної інспекції у Миколаївській області', 'Внесення змін до декларації про готовність об''єкта до експлуатації'),
(11, 'Управління охорони, використання і відтворення водних біоресурсів та регулювання рибальства в Миколаївській області', 'Дозвіл на спеціальне використання водних біоресурсів у рибогосподарських об''єктах (їх частинах)'),
(12, 'Управління охорони, використання і відтворення водних біоресурсів та регулювання рибальства в Миколаївській області', 'Підтвердження законності вилучення водних біоресурсів з середовища їх існування та переробки продуктів лову'),
(13, 'Державна інспекція сільського господарства в Миколаївській області', 'Спеціальний дозвіл на зняття та перенесення грунтового покриву (родючого шару грунту) земельних ділянок'),
(14, 'Управління Держгеокадастру у Миколаївській області', 'Висновок державної експертизи землевпорядної документації щодо об''єктів, які підлягають обов''язковій (первинній, повторній, додатковій) державній експертизі'),
(15, 'Управління Держгеокадастру у Миколаївській області', 'Рішення про передачу у власність, надання у постійне користування та надання в оренду земельних ділянок сільськогосподарського призначення, що перебувають у державній власності '),
(16, 'Управління культури, національностей та релігій Миколаївської обласної державної адміністрації', 'Погодження програм та проектів містобудівних, архітектурних і ландшафтних перетворень, будівельних, меліоративних, шляхових, земельних робіт, реалізація яких може позначитися на стані пам''яток місцевого значення, їх територій і зон охорони'),
(17, 'Управління культури, національностей та релігій Миколаївської обласної державної адміністрації', 'Погодження відчуження або передачі пам''яток місцевого значення іншими власниками чи уповноваженими ними органами іншим особам у володіння, користування або управління'),
(18, 'Управління культури, національностей та релігій Миколаївської обласної державної адміністрації', 'Дозвіл на проведення робіт на пам''ятках місцевого значення (крім пам''яток археології), їх територіях та в зонах охорони на щойно виявлених об''єктах культурної спадщини, реєстрація дозволів на проведення археологічних розвідок, розкопок '),
(19, 'Миколаївське обласне управління лісового та мисливського господарства', 'Дозвіл на переведення земельних лісових ділянок до нелісових земель у цілях, пов''язаних з веденням лісового господарства, без їх вилучення у постійного лісокористувача'),
(20, 'Миколаївське обласне управління лісового та мисливського господарства', 'Спеціальний дозвіл на спеціальне використання лісових ресурсів (лісорубний квиток)'),
(21, 'Миколаївське обласне управління лісового та мисливського господарства', 'Погодження визначення місць розміщення підприємств, споруд та інших об''єктів, що шкідливо впливають на стан і відтворення лісів'),
(22, 'Миколаївське обласне управління лісового та мисливського господарства', 'Погодження змін цільового призначення земельних лісових ділянок'),
(23, 'Головне управління ветеринарної медицини у Миколаївській області', 'Дозвіл на проведення заходів із залученням тварин'),
(24, 'Головне управління ветеринарної медицини у Миколаївській області', 'Експлуатаційний дозвіл для потужностей (об''єктів), які займаються виробництвом харчових продуктів та для агропродовольчих ринків'),
(25, 'Головне управління ветеринарної медицини у Миколаївській області', 'Експлуатаційний дозвіл для потужностей (об''єктів) з переробки неїстівних продуктів тваринного походження, з виробництва, змішування та приготування кормових добавок, преміксів і кормів'),
(26, 'Головне управління ветеринарної медицини у Миколаївській області', 'Експлуатаційний дозвіл для операторів ринку, що провадять діяльність, пов''язану з виробництвом та/або зберіганням харчових продуктів тваринного походження'),
(27, 'Управління екології та природних ресурсів Миколаївської обласної державної адміністрації', 'Висновок Державної екологічної експертизи'),
(28, 'Управління екології та природних ресурсів Миколаївської обласної державної адміністрації', 'Дозвіл на викиди забруднюючих речовин в атмосферне повітря стаціонарними джерелами'),
(29, 'Управління екології та природних ресурсів Миколаївської обласної державної адміністрації', 'Дозвіл на здійсненняоперацій у сфері поводження з відходами (розміщення) та погодження проетів лімітів на утворення та розміщення відходів (крім небезпечних)'),
(30, 'Управління екології та природних ресурсів Миколаївської обласної державної адміністрації', 'Дозвіл на спеціальне використання природних ресурсів у межах територій та об''єктів природно-заповідного фонду загальнодержавного значення'),
(31, 'Управління екології та природних ресурсів Миколаївської обласної державної адміністрації', 'Дозвіл на спеціальне водокористування'),
(32, 'Управління екології та природних ресурсів Миколаївської обласної державної адміністрації', 'Декларація про утворення відходів у відповідному році'),
(33, 'Управління  Держпраці у Миколаївській області', 'Дозвіл на виконання робіт підвищеної небезпеки'),
(34, 'Управління Держпраці у Миколаївській області', ' Дозвіл на застосування машин, механізмів, устаткування підвищеної небезпеки'),
(35, 'Управління  Держпраці у Миколаївській області', ' Дозвіл на експлуатацію машин, механізмів, устаткування підвищеної небезпеки.'),
(36, 'Управління Держпраці у Миколаївській області', 'Декларація відповідності матеріально-технічної бази роботодавця вимогам законодавства з питань охорони праці та промислової безпеки'),
(37, 'Управління Держпраці у Миколаївській області', 'Реєстрація великотоннажних та інших технологічних транспортних засобів, що не підлягають експлуатації на вулично-дорожній мережі загального користування'),
(38, 'Управління Держпраці у Миколаївській області', ' Тимчасова реєстрація технологічних транспортних засобів'),
(39, 'Управління Держпраці у Миколаївській області', 'Ведення обліку та зняття технологічних транспортних засобів з обліку'),
(40, 'Управління Держпраці у Миколаївській області', ' Перереєстрація великовантажних інших технологічних транспортних засобів, що не підлягають експлуатації на вулично-дорожній мережі загального користування'),
(41, 'Головне управління державної санітарно-епідеміологічної служби в Миколаївській області', ' Висновок державної санітарно-епідеміологічної експертизи на розроблені техніку, технології, устаткування інструменти тощо (нормативний, проектний, державний, галузевий стандарт, технічні умови тощо).'),
(42, 'Головне управління державної санітарно-епідеміологічної служби в Миколаївській області', ' Висновок державної санітарно-епідеміологічної експертизи щодо ввезення, реалізації та використання сировини, продукції (вироби, обладнання, технологічні лінії тощо) іноземного виробництва за умови відсутності даних щодо їх безпечності для здоров''я населення.'),
(43, 'Головне управління державної санітарно-епідеміологічної служби в Миколаївській області', ' Висновок державної санітарно-епідеміологічної експеритизи для отримання дозволу на викиди забруднюючих речовин в атмосферне повітря стаціонарними джерелами.'),
(44, 'Головне управління державної санітарно-епідеміологічної служби в Миколаївській області', ' Висновок державної санітарно-епідеміологічної експертизи щодо продукції, напівфабрикатів, речовин, матеріалів та небезпечних факторів, використання, передача або збут яких може завдати шкоди здоров’ю людей.'),
(45, 'Головне управління державної санітарно-епідеміологічної служби в Миколаївській області', 'Дозвіл на проведення діагностичних, експериментальних, випробувальних, вимірювальних робіт на підприємствах, в установах та організаціях, діяльність яких пов''язана з використанням джерел неіонізуючого впромінювання.'),
(46, 'Головне управління державної санітарно-епідеміологічної служби в Миколаївській області', 'Висновок державної санітарно-епідеміологічної експертизи на об''єкт поводження з відходами: місця тимчасового зберігання відходів.'),
(47, 'Головне управління державної санітарно-епідеміологічної служби в Миколаївській області', ' Висновок державної санітарно-епідеміологічної експертизи діючих об’єктів.'),
(48, 'Головне управління державної санітарно-епідеміологічної служби в Миколаївській області', 'Дозвіл (санітарний паспорт) на роботи з радіоактивними речовинами та іншими джерелами іонізуючого випромінювання.');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(10) UNSIGNED NOT NULL,
  `email` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `is_admin` tinyint(1) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `email`, `is_admin`) VALUES
(1, 'admin', 1);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `passwords`
--
ALTER TABLE `passwords`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `rdas`
--
ALTER TABLE `rdas`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `register_admin_services`
--
ALTER TABLE `register_admin_services`
  ADD PRIMARY KEY (`id`),
  ADD KEY `register_admin_services_rda_id_index` (`rda_id`),
  ADD KEY `register_admin_services_snap_id_index` (`snap_id`);

--
-- Индексы таблицы `snaps`
--
ALTER TABLE `snaps`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `passwords`
--
ALTER TABLE `passwords`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- AUTO_INCREMENT для таблицы `rdas`
--
ALTER TABLE `rdas`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;
--
-- AUTO_INCREMENT для таблицы `register_admin_services`
--
ALTER TABLE `register_admin_services`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT для таблицы `snaps`
--
ALTER TABLE `snaps`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=49;
--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
